{
  "AAPL": {
    "news_score": 0.59,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för AAPL (Apple Inc.): Yahoo Finance's John Hyland tracks today's top moving stocks and biggest market stories in this Market Minute. Cloudflare (NET) stating that it has resolved its outage that impacted various platforms and websites and Apple (AAPL) iPhone sales reportedly surging in China."
    ],
    "raw_sentiment": 0.1802,
    "article_count": 5,
    "last_updated": "2025-11-19"
  },
  "MSFT": {
    "news_score": 0.62,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 7 artiklar senaste dagarna.",
      "Sammanfattning för MSFT (Microsoft Corporation): Microsoft (MSFT) announced several new AI features on Tuesday, along with a partnership with Nvidia (NVDA) and Anthropic (ANTH.PVT). Microsoft president of business apps and agents Charles Lamanna joins Asking for a Trend with Josh Lipton and Yahoo Finance Tech Editor Dan Howley to talk about the new tools. Freedom Capital Markets managing director Paul Meeks talks"
    ],
    "raw_sentiment": 0.2332,
    "article_count": 7,
    "last_updated": "2025-11-19"
  },
  "GOOGL": {
    "news_score": 0.74,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för GOOGL (Alphabet Inc.): Alphabet (GOOG, GOOGL) CEO Sundar Pichai said in an interview that there are \"both rational\" and \"elements of irrationality\" in Big Tech's AI spending. Crypto is Macro Now author and former managing director of research at CoinDesk, Noelle Acheson, and Portfolio Wealth Advisors president and chief investment officer, Lee"
    ],
    "raw_sentiment": 0.4876,
    "article_count": 5,
    "last_updated": "2025-11-19"
  },
  "AMZN": {
    "news_score": 0.39,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 4 artiklar senaste dagarna.",
      "Sammanfattning för AMZN (Amazon.com Inc.): Market Catalysts host Julie Hyman tracks several of the day's top trending stock tickers. Kroger takes on $2.6B charge, Amazon's robotaxi in San Francisco. Intuit inking a $100 million deal with OpenAI."
    ],
    "raw_sentiment": -0.2136,
    "article_count": 4,
    "last_updated": "2025-11-19"
  },
  "TSLA": {
    "news_score": 0.7,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för TSLA (Tesla Inc.): Nvidia's (NVDA) CEO Jensen Huang and Tesla's (TSLA) boss, Elon Musk are set to take part in US-Saudi discussions in Washington. Target (TGT) slashed it future guidance and predicts a weak holiday season. The Wall Street Journal reported that Elon Musk’s xAI was on the verge of a $15 billion investment valuing the start"
    ],
    "raw_sentiment": 0.3939,
    "article_count": 5,
    "last_updated": "2025-11-19"
  },
  "FB": {
    "news_score": 0.5,
    "news_reasons": [
      "Inga nyligen identifierade relevanta nyhetsartiklar för bolaget – nyhetsbidraget sätts till neutralt (0.50)."
    ],
    "raw_sentiment": 0.0,
    "article_count": 0,
    "last_updated": "2025-11-19"
  },
  "BRK.B": {
    "news_score": 0.5,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 1 artiklar senaste dagarna.",
      "Sammanfattning för BRK.B (Berkshire Hathaway Inc.): Berkshire Hathaway has just released its 13F filing for the third quarter of 2025. Barchart’s Technical Indicators are Flashing ‘Buy’ as Warren Buffett Loads Up on 17.8 Million Shares of Google Stock."
    ],
    "raw_sentiment": 0.0,
    "article_count": 1,
    "last_updated": "2025-11-19"
  },
  "NVDA": {
    "news_score": 0.32,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 9 artiklar senaste dagarna.",
      "Sammanfattning för NVDA (NVIDIA Corporation): Stocks of chipmakers including AMD, Intel and TSMC waver as markets hold their breath ahead of Nvidia (NVDA)'s earnings report. Cloudflare (NET) ticks up despite a widespread outage. Tesla (TSLA) challenger Xiaomi (1810.HK, XIACY, XIACF, 3CP.F, 1810N.MX) sees shares plummet"
    ],
    "raw_sentiment": -0.3636,
    "article_count": 9,
    "last_updated": "2025-11-19"
  },
  "JPM": {
    "news_score": 0.51,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 8 artiklar senaste dagarna.",
      "Sammanfattning för JPM (JP Morgan Chase & Co.): Wells Fargo Reiterates a Buy on JPMorgan Chase & Co. (JPM), Keeps the PT. JPMorgan to close mobility payments platform acquired from Volkswagen- report. Staff at offices in Luxembourg and Munich will reportedly be affected."
    ],
    "raw_sentiment": 0.0234,
    "article_count": 8,
    "last_updated": "2025-11-19"
  },
  "JNJ": {
    "news_score": 0.76,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 6 artiklar senaste dagarna.",
      "Sammanfattning för JNJ (Johnson & Johnson): J&J this year lost its patent exclusivity for Stelara, its longtime top-selling drug that treats psoriasis and inflammatory bowel disease. The acquisition brings Halda's candidate HLD-0915, a clinical-stage treatment for prostate cancer, into J&J's oncology portfolio."
    ],
    "raw_sentiment": 0.5217,
    "article_count": 6,
    "last_updated": "2025-11-19"
  },
  "V": {
    "news_score": 0.88,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 9 artiklar senaste dagarna.",
      "Sammanfattning för V (Visa Inc.): Visa Inc. (NYSE:V) is one of the Most Profitable Stocks to Buy Now. Visa shares have compounded at an impressive clip since the company's initial public offering in 2008. Mastercard and Visa’s Proposed Settlement Might Change the Case for Investing in MA."
    ],
    "raw_sentiment": 0.752,
    "article_count": 9,
    "last_updated": "2025-11-19"
  },
  "WMT": {
    "news_score": 0.02,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 3 artiklar senaste dagarna.",
      "Sammanfattning för WMT (Walmart Inc.): As Home Depot (HD) stock slides on Tuesday morning after releasing mixed third quarter results and cutting its full-year outlook, Target (TGT) is the next chain retailer to release its quarterly results on Wednesday. Portfolio Wealth Advisors president and CIO Lee Munson shares his expert perspective on Target's biggest challenges as it competes with other retail giants. Yahoo Finance senior reporter"
    ],
    "raw_sentiment": -0.9592,
    "article_count": 3,
    "last_updated": "2025-11-19"
  },
  "PG": {
    "news_score": 0.26,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 2 artiklar senaste dagarna.",
      "Sammanfattning för PG (Procter & Gamble Company): The Procter & Gamble Company (NYSE:PG) is one of the biggest consumer goods companies in the world. Cramer has praised the firm’s management in previous appearances."
    ],
    "raw_sentiment": -0.4819,
    "article_count": 2,
    "last_updated": "2025-11-19"
  },
  "MA": {
    "news_score": 0.77,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 8 artiklar senaste dagarna.",
      "Sammanfattning för MA (Mastercard Incorporated): Mastercard Teams With Polygon To Bring Email-Style Aliases to Self-Custody Crypto Wallets Mastercard is extending its Crypto Credential system to self-custody wallets. Polygon provides the underlying blockchain infrastructure; Mercuryo handles identity onboarding."
    ],
    "raw_sentiment": 0.5381,
    "article_count": 8,
    "last_updated": "2025-11-19"
  },
  "DIS": {
    "news_score": 0.45,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 10 artiklar senaste dagarna.",
      "Sammanfattning för DIS (The Walt Disney Company): U.S. equity markets recorded strong gains in the third quarter, with the S&P 500 Total Return Index rising 8.12% and the Russell 1000 Value surging 5.3%. Wall Street is keeping a close eye on the cruise segment at the House of Mouse. Disney investors are looking for more than just streaming growth."
    ],
    "raw_sentiment": -0.1037,
    "article_count": 10,
    "last_updated": "2025-11-19"
  },
  "HD": {
    "news_score": 0.21,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 10 artiklar senaste dagarna.",
      "Sammanfattning för HD (The Home Depot Inc.): Home Depot (HD) stock is sliding in Tuesday's pre-market trading after the home improvement retailer released third quarter results that missed earnings expectations. The chain cut its full-year profit outlook on a sluggish US housing market and slowdowns in home improvement projects. Telsey Advisory Group senior managing director Joe Feldman explains to Julie Hyman why Home Depot's forecast for its second half was likely"
    ],
    "raw_sentiment": -0.5821,
    "article_count": 10,
    "last_updated": "2025-11-19"
  },
  "BAC": {
    "news_score": 0.73,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 7 artiklar senaste dagarna.",
      "Sammanfattning för BAC (Bank of America Corporation): Bank of America plans to spend billions of dollars on technologies such as artificial intelligence. Wall Street analysts' recommendations tend to be overly optimistic. Aegon NV (AEG) and Bank of America (BAC) have performed compared to their sector so far this year."
    ],
    "raw_sentiment": 0.4604,
    "article_count": 7,
    "last_updated": "2025-11-19"
  },
  "XOM": {
    "news_score": 0.27,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 6 artiklar senaste dagarna.",
      "Sammanfattning för XOM (Exxon Mobil Corporation): ExxonMobil boss says ‘deliberate’ UK Government policies ‘undermining’ business Chairman Paul Greenhouse spoke out after the petrochemical firm announced plans to close the Mossmorran ethylene plant in Fife."
    ],
    "raw_sentiment": -0.4545,
    "article_count": 6,
    "last_updated": "2025-11-19"
  },
  "PFE": {
    "news_score": 0.81,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 3 artiklar senaste dagarna.",
      "Sammanfattning för PFE (Pfizer Inc.): Pfizer (PFE) shares have shown resilience, with a modest uptick over the past week and month. Investors are keeping an eye on the stock’s performance as the company navigates market trends and changing sentiment. PFE trades above its 50-day SMA on recent gains from the Metsera acquisition and a drug pricing agreement with the U.S. administration."
    ],
    "raw_sentiment": 0.6134,
    "article_count": 3,
    "last_updated": "2025-11-19"
  },
  "VZ": {
    "news_score": 0.42,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 7 artiklar senaste dagarna.",
      "Sammanfattning för VZ (Verizon Communications Inc.): Zacks.com users have recently been watching Verizon (VZ) quite a bit. It is worth knowing the facts that could determine the stock's prospects. Verizon will cut about 15,000 jobs after new CEO says ‘cost reductions will be a way of life for us here'"
    ],
    "raw_sentiment": -0.1657,
    "article_count": 7,
    "last_updated": "2025-11-19"
  },
  "NFLX": {
    "news_score": 0.42,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 9 artiklar senaste dagarna.",
      "Sammanfattning för NFLX (Netflix Inc.): NFLX's 90% price drop stems solely from its 10-for-1 split as the company enters a new phase backed by strong operational momentum. JPMorgan cut its price target on Netflix stock as the streaming video leader faces concerns about subscribers and competition."
    ],
    "raw_sentiment": -0.1625,
    "article_count": 9,
    "last_updated": "2025-11-19"
  },
  "ADBE": {
    "news_score": 0.58,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 6 artiklar senaste dagarna.",
      "Sammanfattning för ADBE (Adobe Inc.): Adobe to buy software provider Semrush in $1.9 billion deal. Semrush helps businesses from Amazon to TikTok with search-engine optimization and marketing. Adobe shares have seen some movement lately, climbing 1.3% over the last week."
    ],
    "raw_sentiment": 0.1591,
    "article_count": 6,
    "last_updated": "2025-11-19"
  },
  "CMCSA": {
    "news_score": 0.37,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 4 artiklar senaste dagarna.",
      "Sammanfattning för CMCSA (Comcast Corporation): Comcast Corporation (NASDAQ:CMCSA) is one of the stocks Jim Cramer discussed on his show. Comcast’s stock price has been on something of a rollercoaster lately, with a 0.4% bump over the last week, but still down 27.3% year-to-date."
    ],
    "raw_sentiment": -0.2599,
    "article_count": 4,
    "last_updated": "2025-11-19"
  },
  "KO": {
    "news_score": 0.68,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 10 artiklar senaste dagarna.",
      "Sammanfattning för KO (The Coca-Cola Company): Coca-Cola (KO) stock draws steady attention in the market, with recent performance data showing a mild uptick. Investors tracking KO will notice gains of around 1% this week and nearly 4% over the past month. KO’s recent momentum looks promising, with a 15% year-to-date share price return and a one-year total shareholder return of nearly 18"
    ],
    "raw_sentiment": 0.3567,
    "article_count": 10,
    "last_updated": "2025-11-19"
  },
  "T": {
    "news_score": 0.75,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 10 artiklar senaste dagarna.",
      "Sammanfattning för T (AT&T Inc.): Tutor Perini Corporation (TPC) announced the initiation of a US$0.06 per share quarterly cash dividend, with the first payment scheduled for December 23, 2025. The company also authorized a $200 million share repurchase program. Tutor Perini has quickly become a hot topic among growth-focused investors. The stock has pulled back 5.8% over the last"
    ],
    "raw_sentiment": 0.4938,
    "article_count": 10,
    "last_updated": "2025-11-19"
  },
  "NKE": {
    "news_score": 0.49,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 8 artiklar senaste dagarna.",
      "Sammanfattning för NKE (Nike Inc.): Wells Fargo raised its outlook on Nike, Inc., highlighting increased confidence in the company's turnaround efforts and improved visibility into sales and margins. Under Armour, Inc. (NYSE:UA) is another sports apparel firm that is in the midst of a turnaround. Jim Cramer has expressed faith in the firm's CEO, Elliott Hill."
    ],
    "raw_sentiment": -0.0104,
    "article_count": 8,
    "last_updated": "2025-11-19"
  },
  "MRK": {
    "news_score": 0.93,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 7 artiklar senaste dagarna.",
      "Sammanfattning för MRK (Merck & Co. Inc.): Dow Jones drug giant Merck is breaking out past its latest buy point. Merck stock jumped Tuesday on a surprise win for its drug, sotatercept. Over the last month, Merck’s share price has jumped 9.5% and gained 7.0% this week alone."
    ],
    "raw_sentiment": 0.8544,
    "article_count": 7,
    "last_updated": "2025-11-19"
  },
  "ABT": {
    "news_score": 0.71,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 2 artiklar senaste dagarna.",
      "Sammanfattning för ABT (Abbott Laboratories): Abbott Laboratories (NYSE:ABT) jumps 3.3% this week, though earnings growth is still tracking behind three-year shareholder returns. Abbott reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues."
    ],
    "raw_sentiment": 0.4216,
    "article_count": 2,
    "last_updated": "2025-11-19"
  },
  "PEP": {
    "news_score": 0.72,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 4 artiklar senaste dagarna.",
      "Sammanfattning för PEP (PepsiCo Inc.): PEP, MNST, LW, UNFI and OLLI are five stocks that show improving growth drivers for 2026. Companies with a long history of paying dividends and consistently hiking them remain appealing to income-focused investors. Mid-America Apartment Communities, PepsiCo, and Mondelez International have rewarded shareholders for years."
    ],
    "raw_sentiment": 0.4386,
    "article_count": 4,
    "last_updated": "2025-11-19"
  },
  "CSCO": {
    "news_score": 0.68,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 6 artiklar senaste dagarna.",
      "Sammanfattning för CSCO (Cisco Systems Inc.): Cisco Systems Inc. (NASDAQ:CSCO) also reported earnings the day this show was aired. Cramer had asserted that the stock was cheap and its valuation. Shares of Cisco are trading just under $78 per share. Despite this, retail investors on Reddit have turned starkly bearish."
    ],
    "raw_sentiment": 0.3639,
    "article_count": 6,
    "last_updated": "2025-11-19"
  },
  "ORCL": {
    "news_score": 0.35,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 3 artiklar senaste dagarna.",
      "Sammanfattning för ORCL (Oracle Corporation): Cullen Capital Management, LLC has released its “SCCM Value Equity Strategy” third-quarter investor letter. The US equity market continued the rally in the third quarter, with the S&P 500 returning 8.1% and the Russell 1000 Value surging 5.3%."
    ],
    "raw_sentiment": -0.297,
    "article_count": 3,
    "last_updated": "2025-11-19"
  },
  "INTC": {
    "news_score": 0.56,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för INTC (Intel Corporation): AMD, Intel and TSMC brace for Nvidia earnings: trending stocks. Xiaomi sees shares plummet - even as its EV arm turns an operating profit for the first time. British high-street retailer WH Smith (SMWH.L) pushes for a turnaround."
    ],
    "raw_sentiment": 0.1297,
    "article_count": 5,
    "last_updated": "2025-11-19"
  },
  "CRM": {
    "news_score": 0.65,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 3 artiklar senaste dagarna.",
      "Sammanfattning för CRM (Salesforce Inc.): Despite a slight dip of 1.9% over the last week and 2.5% across the past month, the stock is still up an impressive 65.4% over three years. On November 12, Cantor Fitzgerald maintained its “Overweight” rating on the stock with a price target of $325.00."
    ],
    "raw_sentiment": 0.3091,
    "article_count": 3,
    "last_updated": "2025-11-19"
  },
  "COST": {
    "news_score": 0.55,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 8 artiklar senaste dagarna.",
      "Sammanfattning för COST (Costco Wholesale Corporation): The retail stock is down 15% from its 52-week high. Costco's leadership discussed new initiatives aimed at boosting the company's revenue. The company's multi-year track record stands tall."
    ],
    "raw_sentiment": 0.109,
    "article_count": 8,
    "last_updated": "2025-11-19"
  },
  "ACN": {
    "news_score": 0.74,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 3 artiklar senaste dagarna.",
      "Sammanfattning för ACN (Accenture plc): Accenture invests in Alembic, partners on Causal AI for marketing insights. The two companies will focus on helping clients track and improve the effectiveness of their marketing campaigns."
    ],
    "raw_sentiment": 0.4756,
    "article_count": 3,
    "last_updated": "2025-11-19"
  },
  "CVX": {
    "news_score": 0.62,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 4 artiklar senaste dagarna.",
      "Sammanfattning för CVX (Chevron Corporation): consensus analyst price target for Chevron now stands at $172.80. Chevron (CVX) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects. Stay tuned to discover how you can track these changing perspectives."
    ],
    "raw_sentiment": 0.2361,
    "article_count": 4,
    "last_updated": "2025-11-19"
  },
  "MCD": {
    "news_score": 0.32,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 2 artiklar senaste dagarna.",
      "Sammanfattning för MCD (McDonald's Corporation): The stock has eased back slightly, down 0.7% over the last week and 1.1% in the past month. Recent news about McDonald's ongoing global expansions and new menu innovations has continued. The Trend Of High Returns At McDonald's (NYSE:MCD) Has Us Very Interested."
    ],
    "raw_sentiment": -0.3585,
    "article_count": 2,
    "last_updated": "2025-11-19"
  },
  "DHR": {
    "news_score": 0.14,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 1 artiklar senaste dagarna.",
      "Sammanfattning för DHR (Danaher Corporation): Shareholders 2.8% loss in Danaher (NYSE:DHR) partly attributable to the company's decline in earnings over past three years. Many investors define successful investing as beating the market average over the long term."
    ],
    "raw_sentiment": -0.7166,
    "article_count": 1,
    "last_updated": "2025-11-19"
  },
  "MDT": {
    "news_score": 0.41,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 6 artiklar senaste dagarna.",
      "Sammanfattning för MDT (Medtronic plc): Julie Hyman takes a look at three of the trending stories on Wall Street. Google unveils Gemini 3, Klarna & Medtronic stocks react to earnings. Stay up to date on the latest market action, minute-by-minute with Yahoo Finance's Market Minute."
    ],
    "raw_sentiment": -0.1751,
    "article_count": 6,
    "last_updated": "2025-11-19"
  },
  "LLY": {
    "news_score": 0.77,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 9 artiklar senaste dagarna.",
      "Sammanfattning för LLY (Eli Lilly and Company): Eli Lilly shares rose again Tuesday, their sixth increase in the past seven sessions. The drugmaker's market cap also closed at a record, $973.8 billion, as Lilly inched closer to the $1 trillion market cap milestone."
    ],
    "raw_sentiment": 0.5361,
    "article_count": 9,
    "last_updated": "2025-11-19"
  },
  "TXN": {
    "news_score": 0.5,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 1 artiklar senaste dagarna.",
      "Sammanfattning för TXN (Texas Instruments Incorporated): Texas Instruments’ consensus analyst price target has recently eased from $190.31 to $189.56 per share. This adjustment reflects cautious optimism as the industry faces persistent headwinds and shifting growth expectations. Stay updated as the Fair Value for Texas Instruments shifts by adding it to your watchlist or portfolio."
    ],
    "raw_sentiment": 0.0,
    "article_count": 1,
    "last_updated": "2025-11-19"
  },
  "UNH": {
    "news_score": 0.49,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 3 artiklar senaste dagarna.",
      "Sammanfattning för UNH (UnitedHealth Group Incorporated): UnitedHealth Group Incorporated (NYSE:UNH) is one of the stocks Jim Cramer expressed his thoughts on. The stock’s recent performance has been rocky, with a 10.1% decline over the past month and a 36.5% drop year-to-date. This has raised questions about both risk and reward potential from here."
    ],
    "raw_sentiment": -0.0187,
    "article_count": 3,
    "last_updated": "2025-11-19"
  },
  "BMY": {
    "news_score": 0.4,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för BMY (Bristol-Myers Squibb Company): Bristol-Myers Squibb Company (NYSE:BMY) is included among the 15 Best Passive Income Stocks to Buy Right Now. BMY shares drop after halting the Librexia ACS trial. Other milvexian studies continue with top-line data expected in 2026."
    ],
    "raw_sentiment": -0.202,
    "article_count": 5,
    "last_updated": "2025-11-19"
  },
  "QCOM": {
    "news_score": 0.47,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 4 artiklar senaste dagarna.",
      "Sammanfattning för QCOM (QUALCOMM Incorporated): South Korea antitrust regulator probes Arm Holdings in Seoul, source says. South Korea's Fair Trade Commission visited Arm's Seoul office. Move stems in part from a complaint by Qualcomm Inc. alleging that Arm is hurting competition."
    ],
    "raw_sentiment": -0.0677,
    "article_count": 4,
    "last_updated": "2025-11-19"
  },
  "HON": {
    "news_score": 0.21,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för HON (Honeywell International Inc.): BofA Securities analyst Andrew Obin cut his rating on Honeywell shares all the way to Sell from Buy. BofA warns that the company faces a difficult stretch of catalysts ahead of its Aerospace spin-off and continues to trail peers on growth."
    ],
    "raw_sentiment": -0.5764,
    "article_count": 5,
    "last_updated": "2025-11-19"
  },
  "AMGN": {
    "news_score": 0.73,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 4 artiklar senaste dagarna.",
      "Sammanfattning för AMGN (Amgen Inc.): Jim Cramer has started to discuss pharmaceutical giant Amgen Inc. (NASDAQ:AMGN) more frequently. Most of his discussions surround the firm’s Repatha drug that aims to reduce cholesterol and prevent heart attacks. Investors are starting to re-evaluate the pharmaceutical giant's current valuation in light of recent gains."
    ],
    "raw_sentiment": 0.4696,
    "article_count": 4,
    "last_updated": "2025-11-19"
  },
  "SBUX": {
    "news_score": 0.45,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 8 artiklar senaste dagarna.",
      "Sammanfattning för SBUX (Starbucks Corporation): Starbucks Corporation (NASDAQ:SBUX) is one of the stocks on Jim Cramer’s radar. Cramer has continued to stress that viewers have faith in the firm. In its latest quarterly earnings report, Starbucks said its operating margins had shrunk by 5 percentage points year over year."
    ],
    "raw_sentiment": -0.0962,
    "article_count": 8,
    "last_updated": "2025-11-19"
  },
  "LOW": {
    "news_score": 0.37,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 6 artiklar senaste dagarna.",
      "Sammanfattning för LOW (Lowe's Companies Inc.): It's a big earnings week as a handful of major retailers share their quarterly results. As the holiday shopping season inches closer, is this shaping up to look like a tougher than expected period for these stores? Telsey Advisory Group senior managing director Joe Feldman touches on what to expect from Lowe's (LOW), Target (TGT), and Walmart's (WMT) earnings results."
    ],
    "raw_sentiment": -0.2509,
    "article_count": 6,
    "last_updated": "2025-11-19"
  },
  "GE": {
    "news_score": 0.77,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för GE (General Electric Company): General Electric has soared 80.8% year-to-date and delivered an impressive 73.3% return over the last twelve months. GE Aerospace reported strong third-quarter earnings as its flywheel looks set to benefit from steady demand. Embraer stock remains in buy range."
    ],
    "raw_sentiment": 0.5474,
    "article_count": 5,
    "last_updated": "2025-11-19"
  }
}