{
  "AAPL": {
    "news_score": 0.53,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 5 articles from the last few days.",
      "News summary for AAPL (Apple Inc.): Bloomberg’s Mark Gurman has shared that Apple Inc. CEO Tim Cook is likely to retain his position until at least mid-2026. The Financial Times had earlier reported this month that Apple was gearing up for Cook's departure “as soon as next year."
    ],
    "raw_sentiment": 0.0553,
    "article_count": 5,
    "last_updated": "2025-11-24"
  },
  "MSFT": {
    "news_score": 0.5,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 3 articles from the last few days.",
      "News summary for MSFT (Microsoft Corporation): Hayley Martin founded Once Upon a Charm, a Seattle-based startup selling prescription glasses designed specifically for girls between the ages of 4 and 9. The frames retail at $250 per pair and feature a patent-pending system allowing wearers to attach decorative charms to the temples."
    ],
    "raw_sentiment": 0.0,
    "article_count": 3,
    "last_updated": "2025-11-24"
  },
  "GOOGL": {
    "news_score": 0.4,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 3 articles from the last few days.",
      "News summary for GOOGL (Alphabet Inc.): Alphabet (GOOGL) shares have been on the move recently, gaining nearly 44% over the past 3 months. Wall Street is straining to absorb a flood of new bonds from tech companies funding their artificial intelligence investments, adding to the recent pressure in markets."
    ],
    "raw_sentiment": -0.2049,
    "article_count": 3,
    "last_updated": "2025-11-24"
  },
  "AMZN": {
    "news_score": 0.41,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for AMZN (Amazon.com Inc.): Wall Street is straining to absorb a flood of new bonds from tech companies funding their artificial intelligence investments. Since the start of September, so-called AI hyperscalers Amazon, Alphabet Meta Platforms and Oracle have issued nearly $90 billion of investment-grade bonds."
    ],
    "raw_sentiment": -0.185,
    "article_count": 6,
    "last_updated": "2025-11-24"
  },
  "TSLA": {
    "news_score": 0.65,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for TSLA (Tesla Inc.): Tesla CEO Elon Musk says the company is working on a new AI chip design every 12 months. Analysts are saying Tesla could hit 1,003 dollars by 2030, a long-term target."
    ],
    "raw_sentiment": 0.2985,
    "article_count": 7,
    "last_updated": "2025-11-24"
  },
  "FB": {
    "news_score": 0.5,
    "news_reasons": [
      "No recently identified relevant news articles for this company – the news contribution is set to neutral (0.50)."
    ],
    "raw_sentiment": 0.0,
    "article_count": 0,
    "last_updated": "2025-11-24"
  },
  "BRK.B": {
    "news_score": 0.5,
    "news_reasons": [
      "No recently identified relevant news articles for this company – the news contribution is set to neutral (0.50)."
    ],
    "raw_sentiment": 0.0,
    "article_count": 0,
    "last_updated": "2025-11-24"
  },
  "NVDA": {
    "news_score": 0.53,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for NVDA (NVIDIA Corporation): NVIDIA Corporation (NASDAQ:NVDA) is one of the stocks Jim Cramer recently offered insights on. Billionaire Stanley Druckenmiller Dropped Nvidia, Palantir, and Eli Lilly Over the Past Year and Just Bought the 2 Cheapest Magnificent Seven Stocks."
    ],
    "raw_sentiment": 0.0591,
    "article_count": 6,
    "last_updated": "2025-11-24"
  },
  "JPM": {
    "news_score": 0.61,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 5 articles from the last few days.",
      "News summary for JPM (JP Morgan Chase & Co.): consensus analyst price target for JPMorgan Chase has ticked upward, now sitting at $328.09 compared to $327.70 previously. Michael Feroli, chief US economist at JPMorgan Securities, says a December rate cut will be a \"very close call\""
    ],
    "raw_sentiment": 0.2279,
    "article_count": 5,
    "last_updated": "2025-11-24"
  },
  "JNJ": {
    "news_score": 0.97,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 2 articles from the last few days.",
      "News summary for JNJ (Johnson & Johnson): The consensus analyst price target for Johnson & Johnson has risen slightly from $199.56 to $200.82. This adjustment reflects renewed optimism driven by a combination of strong business execution, strategic initiatives such as the planned orthopedics spin-out."
    ],
    "raw_sentiment": 0.9313,
    "article_count": 2,
    "last_updated": "2025-11-24"
  },
  "V": {
    "news_score": 0.61,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 10 articles from the last few days.",
      "News summary for V (Visa Inc.): Visa's stock has seen mixed momentum lately, with a slight drop of 0.6% in the past week and down 5.6%. Visa's earnings growth could slow, and it could still deliver better returns than the S&P 500. This dividend-paying growth stock is a top buy for investors seeking a high-quality company at a favorable value."
    ],
    "raw_sentiment": 0.2122,
    "article_count": 10,
    "last_updated": "2025-11-24"
  },
  "WMT": {
    "news_score": 0.58,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for WMT (Walmart Inc.): Walmart Inc. (NYSE:WMT) is one of the stocks Jim Cramer recently offered insights on. Cramer made some positive comments about the stock and the company’s quarter. He believes that Costco Wholesale Corporation (NASDAQ:COST) is in freefall."
    ],
    "raw_sentiment": 0.1646,
    "article_count": 7,
    "last_updated": "2025-11-24"
  },
  "PG": {
    "news_score": 0.49,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for PG (Procter & Gamble Company): The Procter & Gamble Company (NYSE:PG) is one of the stocks Jim Cramer answered questions about. The stock just gained 2.2% in the past week, although it’s still down 0.8% this month. PG leans on premium, high-performance products and targeted marketing to strengthen margins and consumer loyalty."
    ],
    "raw_sentiment": -0.0297,
    "article_count": 7,
    "last_updated": "2025-11-24"
  },
  "MA": {
    "news_score": 0.34,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 4 articles from the last few days.",
      "News summary for MA (Mastercard Incorporated): A number of stocks jumped in the afternoon session after investors grew more optimistic about a potential Federal Reserve interest rate cut in December. Mastercard (NYSE:MA) sheds 5.0% this week, as yearly returns fall more in line with earnings growth."
    ],
    "raw_sentiment": -0.3132,
    "article_count": 4,
    "last_updated": "2025-11-24"
  },
  "DIS": {
    "news_score": 0.55,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for DIS (The Walt Disney Company): Disney has increased its 2026 dividend by 50% and the payout has risen 1.5X since 2023. Netflix's 10-For-1 Stock Split Takes Effect: Hold for Now or Fold? (Revised)"
    ],
    "raw_sentiment": 0.1067,
    "article_count": 7,
    "last_updated": "2025-11-24"
  },
  "HD": {
    "news_score": 0.19,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 10 articles from the last few days.",
      "News summary for HD (The Home Depot Inc.): Home Depot, Inc. (NYSE:HD) is one of the stocks Jim Cramer recently offered insights on. Cramer said that the company’s performance is dependant on whether the Fed cuts rate during the next meeting or not. Home Depot recently reported weaker-than-expected third-quarter earnings."
    ],
    "raw_sentiment": -0.6114,
    "article_count": 10,
    "last_updated": "2025-11-24"
  },
  "BAC": {
    "news_score": 0.63,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for BAC (Bank of America Corporation): Bank of America (BAC) settled at $51.56, representing a +1.1% change from its previous close. Citi’s Corporate Reorganization Elevates Its Wealth Management Division. U.S. Banks Shelve $20 Billion Bailout Plan for Argentina."
    ],
    "raw_sentiment": 0.2619,
    "article_count": 7,
    "last_updated": "2025-11-24"
  },
  "XOM": {
    "news_score": 0.64,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 4 articles from the last few days.",
      "News summary for XOM (Exxon Mobil Corporation): Michael C. \"Tug\" Hanley will become executive vice president and chief commercial officer. This appointment, along with the sale of a 40% stake in the Bahia NGL pipeline to ExxonMobil, highlights Enterprise’s focus on leadership continuity and collaborative infrastructure growth."
    ],
    "raw_sentiment": 0.2809,
    "article_count": 4,
    "last_updated": "2025-11-24"
  },
  "PFE": {
    "news_score": 0.61,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 4 articles from the last few days.",
      "News summary for PFE (Pfizer Inc.): Pfizer's performance has been mixed lately. Shares dipped just 0.1% in the last week, inched up 1.3% over the past month, but are still down 5.9% year to date. Recent headlines about Pfizer have focused on its latest product developments."
    ],
    "raw_sentiment": 0.2206,
    "article_count": 4,
    "last_updated": "2025-11-24"
  },
  "VZ": {
    "news_score": 0.43,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for VZ (Verizon Communications Inc.): As layoffs mount, is the 'no-hire, no-fire' labor market narrative breaking? A raft of job cut announcements this fall from big companies like Amazon, Verizon, and Target calls into question the state of what has been deemed a “no- hire,no-fire” labor market. Jim Cramer says “I want you to scale out of Verizon"
    ],
    "raw_sentiment": -0.1466,
    "article_count": 6,
    "last_updated": "2025-11-24"
  },
  "NFLX": {
    "news_score": 0.48,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 9 articles from the last few days.",
      "News summary for NFLX (Netflix Inc.): Paramount Skydance, Netflix, and Comcast have all submitted their bids to possibly acquire Warner Bros. Discovery. Bitcoin sinks to $84,000 per token as the crypto asset is looking at its worst trading month since 2022. US stock futures are rising in Friday's premarket trading after Thursday's volatile trading day."
    ],
    "raw_sentiment": -0.0486,
    "article_count": 9,
    "last_updated": "2025-11-24"
  },
  "ADBE": {
    "news_score": 0.61,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 8 articles from the last few days.",
      "News summary for ADBE (Adobe Inc.): Adobe (ADBE) shares edged up in recent trading, despite the absence of a new headline event or announcement. After a steep drop earlier this year, Adobe’s share price has started to claw back some ground, gaining 3.8% over the last day. Investors may be considering the company's broader business trends and evaluating how its long-term valuation appears."
    ],
    "raw_sentiment": 0.212,
    "article_count": 8,
    "last_updated": "2025-11-24"
  },
  "CMCSA": {
    "news_score": 0.61,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 4 articles from the last few days.",
      "News summary for CMCSA (Comcast Corporation): Skydance Corp., Netflix Inc. and Comcast Corp. have all made offers for all or part of the New York-based entertainment giant. Comcast and Netflix are most interested in the film and TV library, which includes everything from Bugs Bunny."
    ],
    "raw_sentiment": 0.2119,
    "article_count": 4,
    "last_updated": "2025-11-24"
  },
  "KO": {
    "news_score": 0.57,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for KO (The Coca-Cola Company): Coca-Cola's shares have climbed 15.2% year-to-date and 15.0% over the last year, with the latest close at $71.21. This hints at renewed investor optimism and possibly changing risk perceptions. Investors are increasingly seeking stability and income through dividend stocks."
    ],
    "raw_sentiment": 0.1474,
    "article_count": 7,
    "last_updated": "2025-11-24"
  },
  "T": {
    "news_score": 0.31,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 10 articles from the last few days.",
      "News summary for T (AT&T Inc.): T-Mobile faces heightened competition from its competitors, which has contributed to it seeing a slight uptick in customer losses in recent months. Verizon has been using artificial intelligence to scan bills from rival phone carriers, offering customized deals."
    ],
    "raw_sentiment": -0.3755,
    "article_count": 10,
    "last_updated": "2025-11-24"
  },
  "NKE": {
    "news_score": 0.5,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for NKE (Nike Inc.): Nike (NKE) reached $61.43 at the closing of the latest trading day, reflecting a -1.93% change compared to its last close. A number of stocks jumped in the afternoon session after comments from a key Federal Reserve official bolstered hopes for an interest rate cut."
    ],
    "raw_sentiment": 0.004,
    "article_count": 6,
    "last_updated": "2025-11-24"
  },
  "MRK": {
    "news_score": 0.73,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 4 articles from the last few days.",
      "News summary for MRK (Merck & Co. Inc.): Cidara Therapeutics Inc. (NASDAQ:CDTX) is the top stock in our list of the hottest SMID-cap stocks so far in 2025 with a 717% share price surge year-to-date. Merck, Altria, and Genuine Parts have rewarded shareholders for years and recently announced dividend increases."
    ],
    "raw_sentiment": 0.4536,
    "article_count": 4,
    "last_updated": "2025-11-24"
  },
  "ABT": {
    "news_score": 0.71,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 8 articles from the last few days.",
      "News summary for ABT (Abbott Laboratories): Abbott Laboratories (NYSE:ABT) is one of the stocks Jim Cramer recently offered insights on. Cramer highlighted the company's acquisition of Exact Sciences and said that it complements Abbott’s diagnostic business. This show marked more than a month after Cramer discussed pharmaceuticals and diagnostics devices firm Abbott Laboratories."
    ],
    "raw_sentiment": 0.4257,
    "article_count": 8,
    "last_updated": "2025-11-24"
  },
  "PEP": {
    "news_score": 0.72,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for PEP (PepsiCo Inc.): PepsiCo’s share price has seen some pressure this year, with a 30-day return of -4.38% and a year-to-date decline of 2.58%. The board recently announced a 5% increase in its quarterly dividend, raising the annualized payout to US$5.69 per share. PepsiCo trades at $146.70 per"
    ],
    "raw_sentiment": 0.4341,
    "article_count": 6,
    "last_updated": "2025-11-24"
  },
  "CSCO": {
    "news_score": 0.61,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 5 articles from the last few days.",
      "News summary for CSCO (Cisco Systems Inc.): Many investors are keeping a close eye on Cisco for hints about untapped potential or hidden risks. Cisco’s stock has been on a rollercoaster, slipping -2.4% this week. Recent acquisition headlines and industry partnerships have pushed Cisco into the spotlight."
    ],
    "raw_sentiment": 0.2213,
    "article_count": 5,
    "last_updated": "2025-11-24"
  },
  "ORCL": {
    "news_score": 0.49,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for ORCL (Oracle Corporation): Wall Street is straining to absorb a flood of new bonds from tech companies funding their artificial intelligence investments. Since the start of September, so-called AI hyperscalers have issued nearly $90 billion of investment-grade bonds. Nvidia and Oracle both offer AI growth potential, but their fundamentals make one a clearer choice."
    ],
    "raw_sentiment": -0.0103,
    "article_count": 7,
    "last_updated": "2025-11-24"
  },
  "INTC": {
    "news_score": 0.75,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 5 articles from the last few days.",
      "News summary for INTC (Intel Corporation): Intel's stock narrative is evolving in response to a recent price target update. The fair value remains steady at $37.27 per share, while the discount rate has increased from 11.64% to 11.78%. This adjustment reflects both optimism around Intel's execution and clarity in its AI strategy."
    ],
    "raw_sentiment": 0.4961,
    "article_count": 5,
    "last_updated": "2025-11-24"
  },
  "CRM": {
    "news_score": 0.33,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for CRM (Salesforce Inc.): Salesforce (CRM) shares recently moved higher as investors digested the company's steady revenue and net income growth. Salesforce’s consensus analyst price target has been revised lower, with fair value estimates slipping from $334.68 to $330.59 per share."
    ],
    "raw_sentiment": -0.3302,
    "article_count": 6,
    "last_updated": "2025-11-24"
  },
  "COST": {
    "news_score": 0.45,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 8 articles from the last few days.",
      "News summary for COST (Costco Wholesale Corporation): Costco stock has dipped recently, but investors should take a closer look at the bigger picture. BJ's Wholesale trades at a sizable discount to Costco, making it an interesting idea for investors who think Costco stock is too expensive."
    ],
    "raw_sentiment": -0.1096,
    "article_count": 8,
    "last_updated": "2025-11-24"
  },
  "ACN": {
    "news_score": 0.52,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for ACN (Accenture plc): Accenture (ACN) is gaining attention after revealing new collaborations with PPL Corporation and Essity. These moves highlight the firm's growing impact on digital transformation. Momentum around Accenture has been mixed, with shares jumping 4.6% in the past day."
    ],
    "raw_sentiment": 0.0392,
    "article_count": 6,
    "last_updated": "2025-11-24"
  },
  "CVX": {
    "news_score": 0.65,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for CVX (Chevron Corporation): Chevron's Nov. 12 Investor Day outlined a cash flow plan that implies a potentially sizable dividend hike. Chevron's stock has been on a bit of a seesaw lately, falling 3.4% over the last week. The oil and gas giant's prioritization of profits over production could lead to steady gains in the years ahead."
    ],
    "raw_sentiment": 0.2959,
    "article_count": 6,
    "last_updated": "2025-11-24"
  },
  "MCD": {
    "news_score": 0.59,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 5 articles from the last few days.",
      "News summary for MCD (McDonald's Corporation): SoFi lets you buy McDonald's stock with zero commissions. New users who fund their account can receive up to 1,000 dollars in stock. Discount retail chain has closed nearly 700 stores."
    ],
    "raw_sentiment": 0.1776,
    "article_count": 5,
    "last_updated": "2025-11-24"
  },
  "DHR": {
    "news_score": 0.5,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 2 articles from the last few days.",
      "News summary for DHR (Danaher Corporation): Danaher (DHR) reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues. The projected fair value for Danaher is US$218."
    ],
    "raw_sentiment": 0.0,
    "article_count": 2,
    "last_updated": "2025-11-24"
  },
  "MDT": {
    "news_score": 0.67,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 8 articles from the last few days.",
      "News summary for MDT (Medtronic plc): Medtronic plc (NYSE:MDT) is a medical technology company that makes and sells devices for cardiovascular, neuroscience, and surgical applications. Medtronic’s share price has climbed 3.3% in the last week and is up a notable 23.8% year-to-date, suggesting either confidence in its long-term prospects or changing attitudes around risk"
    ],
    "raw_sentiment": 0.3376,
    "article_count": 8,
    "last_updated": "2025-11-24"
  },
  "LLY": {
    "news_score": 0.79,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for LLY (Eli Lilly and Company): Stanley Druckenmiller Dropped Nvidia, Palantir, and Eli Lilly Over the Past Year and Just Bought the 2 Cheapest Magnificent Seven Stocks. Eli Lilly’s weight-loss drugs have made it the first pharma company to hit a $1tn market valuation, a sharp turnaround from this summer."
    ],
    "raw_sentiment": 0.5863,
    "article_count": 7,
    "last_updated": "2025-11-24"
  },
  "TXN": {
    "news_score": 0.34,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 3 articles from the last few days.",
      "News summary for TXN (Texas Instruments Incorporated): Texas Instruments reported a 14% year-over-year revenue increase for Q3. The company also announced a 4% dividend increase and a cautious Q4 outlook for the semiconductor market. An uptick in short interest, combined with recent insider share sales, signals that some investors are growing wary despite positive operational performance."
    ],
    "raw_sentiment": -0.3142,
    "article_count": 3,
    "last_updated": "2025-11-24"
  },
  "UNH": {
    "news_score": 0.64,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 9 articles from the last few days.",
      "News summary for UNH (UnitedHealth Group Incorporated): Former FDA chief Scott Gottlieb joins UnitedHealth board. UnitedHealth Group Incorporated (UNH) Outlook Strong, Analysts Watch Closely. Wells Fargo analyst Stephen Baxter reaffirmed a Buy rating on UnitedHealth with a price target of $400."
    ],
    "raw_sentiment": 0.2737,
    "article_count": 9,
    "last_updated": "2025-11-24"
  },
  "BMY": {
    "news_score": 0.22,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 5 articles from the last few days.",
      "News summary for BMY (Bristol-Myers Squibb Company): Bristol-Myers Squibb faces a sharp drop in sales of Revlimid, a leading treatment for multiple myeloma that lost patent protection in 2022. Other flagship products approaching their loss of exclusivity in 2028 include Eliquis, a blood thinner."
    ],
    "raw_sentiment": -0.5598,
    "article_count": 5,
    "last_updated": "2025-11-24"
  },
  "QCOM": {
    "news_score": 0.33,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for QCOM (QUALCOMM Incorporated): QCOM shares have seen some ups and downs recently, dropping 6.1% over the last week but still posting a 6.3% gain year to date. News around QUALCOMM has pointed to shifting investor sentiment in the chip sector."
    ],
    "raw_sentiment": -0.3428,
    "article_count": 7,
    "last_updated": "2025-11-24"
  },
  "HON": {
    "news_score": 0.49,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 2 articles from the last few days.",
      "News summary for HON (Honeywell International Inc.): Bank of America double-downgraded Honeywell, but the stock still has ~30% upside potential to the consensus price target. The stock has faced some rough waters lately, dropping 5.5% in the last week."
    ],
    "raw_sentiment": -0.0167,
    "article_count": 2,
    "last_updated": "2025-11-24"
  },
  "AMGN": {
    "news_score": 0.74,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 2 articles from the last few days.",
      "News summary for AMGN (Amgen Inc.): Rising relative strength lines are making it clear that money is flowing to this area. Amgen is the top weight in IBB according to iShares data."
    ],
    "raw_sentiment": 0.4741,
    "article_count": 2,
    "last_updated": "2025-11-24"
  },
  "SBUX": {
    "news_score": 0.38,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for SBUX (Starbucks Corporation): Starbucks stock edged up 0.7% in the past week, but is still down 7.4% year-to-date and 14.5% over the last year. Jim Cramer: “These days, you can use a sale like the one we are experiencing, and I don’t think it’s necessarily over, we’re not"
    ],
    "raw_sentiment": -0.2458,
    "article_count": 6,
    "last_updated": "2025-11-24"
  },
  "LOW": {
    "news_score": 0.53,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for LOW (Lowe's Companies Inc.): Jim Cramer discussed the company's CEO's comments around the state of consumers. Lowe's shares are seeing a relief rally, as third-quarter results cleared a very low bar. Lowe’s comps slightly outperformed its larger peer, with that occurring only once in the prior eight quarters."
    ],
    "raw_sentiment": 0.0543,
    "article_count": 7,
    "last_updated": "2025-11-24"
  },
  "GE": {
    "news_score": 0.53,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 8 articles from the last few days.",
      "News summary for GE (General Electric Company): GE (GE) reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues. Trump says $270 billion in deals being signed at US-Saudi Forum."
    ],
    "raw_sentiment": 0.0659,
    "article_count": 8,
    "last_updated": "2025-11-24"
  }
}