{
  "AAPL": {
    "news_score": 0.43,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for AAPL (Apple Inc.): Apple cut dozens of jobs in its sales teams, according to a report from Bloomberg. It's a rare move from the tech giant, which tends to conduct layoffs less frequently than its peers."
    ],
    "raw_sentiment": -0.142,
    "article_count": 7,
    "last_updated": "2025-11-25"
  },
  "MSFT": {
    "news_score": 0.75,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 3 articles from the last few days.",
      "News summary for MSFT (Microsoft Corporation): Shares of Google parent Alphabet surged Monday, putting the Magnificent Seven company less than 5% away from a $4 trillion market capitalization. The stock's rise of 10% over two days gives it a market cap of around $3.843 trillion, according to Dow Jones Market Data."
    ],
    "raw_sentiment": 0.4989,
    "article_count": 3,
    "last_updated": "2025-11-25"
  },
  "GOOGL": {
    "news_score": 0.41,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for GOOGL (Alphabet Inc.): Alphabet (GOOG, GOOGL) is seeing its shares soar thanks to early praise for Google's Gemini 3. Anthropic (ANTH.PVT) may not let Google have the spotlight for long, debuting its Claude Opus 4.5 model on Monday. Stay up to date on the latest market action, minute-by-minute, with&n"
    ],
    "raw_sentiment": -0.1886,
    "article_count": 6,
    "last_updated": "2025-11-25"
  },
  "AMZN": {
    "news_score": 0.74,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 9 articles from the last few days.",
      "News summary for AMZN (Amazon.com Inc.): There are a number of stocks on the move the morning of Monday, Nov. 24. Market Catalysts Anchor Julie Hyman takes a closer look at the headlines driving trading. Anthropic on Monday debuted its Claude Opus 4.5, which the company says is its most powerful AI model yet."
    ],
    "raw_sentiment": 0.4897,
    "article_count": 9,
    "last_updated": "2025-11-25"
  },
  "TSLA": {
    "news_score": 0.57,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for TSLA (Tesla Inc.): Tesla (TSLA) stock surged during Monday's trading session following comments from CEO Elon Musk and a bullish call from Melius Research. Yahoo Finance Senior Autos Reporter Pras Subramanian joins Market Domination Overtime host Josh Lipton to discuss."
    ],
    "raw_sentiment": 0.1475,
    "article_count": 6,
    "last_updated": "2025-11-25"
  },
  "FB": {
    "news_score": 0.5,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 1 articles from the last few days.",
      "News summary for FB (Meta Platforms Inc.): Meta, Microsoft, and Apple have either requested or obtained authorizations from the Federal Energy Regulatory Commission (FERC) to sell wholesale power."
    ],
    "raw_sentiment": 0.0,
    "article_count": 1,
    "last_updated": "2025-11-25"
  },
  "BRK.B": {
    "news_score": 0.5,
    "news_reasons": [
      "No recently identified relevant news articles for this company – the news contribution is set to neutral (0.50)."
    ],
    "raw_sentiment": 0.0,
    "article_count": 0,
    "last_updated": "2025-11-25"
  },
  "NVDA": {
    "news_score": 0.26,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for NVDA (NVIDIA Corporation): Hennion & Walsh CIO Kevin Mahn doesn't believe the AI bubble is anywhere near bursting. Mahn explains certain risk factors that could hinder the longevity of the current bull market. Opening Bid host Brian Sozzi examines what the next catalyst for the market could be."
    ],
    "raw_sentiment": -0.4756,
    "article_count": 6,
    "last_updated": "2025-11-25"
  },
  "JPM": {
    "news_score": 0.24,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for JPM (JP Morgan Chase & Co.): JPMorgan Chase & Co. (JPM) is Attracting Investor Attention. Analysts at Bitcoin For Corporations have accused JP Morgan Chase of causing the October 10 crypto market crash. They cite a 42-day-old document that preceded the $19 billion liquidation cascade."
    ],
    "raw_sentiment": -0.5165,
    "article_count": 7,
    "last_updated": "2025-11-25"
  },
  "JNJ": {
    "news_score": 0.91,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 3 articles from the last few days.",
      "News summary for JNJ (Johnson & Johnson): Johnson & Johnson (NYSE:JNJ) is a global healthcare company that develops, manufactures, and sells pharmaceutical products and medical devices. Wall Street analysts expect the company to post EPS of $0.82 in Q4 2025."
    ],
    "raw_sentiment": 0.8161,
    "article_count": 3,
    "last_updated": "2025-11-25"
  },
  "V": {
    "news_score": 0.73,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 10 articles from the last few days.",
      "News summary for V (Visa Inc.): Crypto Wallet Firm Exodus Buys Baanx and Monavate for $175M. Visa's stock has seen mixed momentum lately, with a slight drop of 0.6% in the past week. Jim Cramer says “Capital One Discover Has Got Really Fabulous Scale”"
    ],
    "raw_sentiment": 0.4609,
    "article_count": 10,
    "last_updated": "2025-11-25"
  },
  "WMT": {
    "news_score": 0.59,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for WMT (Walmart Inc.): Walmart (WMT) stock is in focus after the retail giant wowed Wall Street with earnings. Capital Advisors portfolio manager and head of equity, David Wagner, joins Market Domination to explain how Walmart's tech efforts have helped it compete with other retailers and justify its stock's valuation."
    ],
    "raw_sentiment": 0.1731,
    "article_count": 7,
    "last_updated": "2025-11-25"
  },
  "PG": {
    "news_score": 0.4,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 5 articles from the last few days.",
      "News summary for PG (Procter & Gamble Company): The Procter & Gamble Company (NYSE:PG) is one of the stocks Jim Cramer answered questions about. The stock just gained 2.2% in the past week, although it’s still down 0.8% this month and has slipped 9.1% year-to-date."
    ],
    "raw_sentiment": -0.1913,
    "article_count": 5,
    "last_updated": "2025-11-25"
  },
  "MA": {
    "news_score": 0.78,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 5 articles from the last few days.",
      "News summary for MA (Mastercard Incorporated): V taps festive mall traffic through Link's Christmas rewards. Carnival Cruise is making a key change to its loyalty program revamp. FirstCash, Mastercard, Western Union, and Nelnet Shares Skyrocket, What You Need To Know."
    ],
    "raw_sentiment": 0.556,
    "article_count": 5,
    "last_updated": "2025-11-25"
  },
  "DIS": {
    "news_score": 0.55,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 9 articles from the last few days.",
      "News summary for DIS (The Walt Disney Company): Disney may have the best slate of blockbusters out there for the holidays and through 2026. The media and entertainment conglomerate has been adding to its cruise fleet, giving investors a positive focal point in a business beset by competition, rising expenses, and inflation."
    ],
    "raw_sentiment": 0.0926,
    "article_count": 9,
    "last_updated": "2025-11-25"
  },
  "HD": {
    "news_score": 0.32,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 10 articles from the last few days.",
      "News summary for HD (The Home Depot Inc.): Last week earnings results from retailers were mixed with Walmart (WMT) being a winner and Home Depot (HD) a loser. Russ Mould from AJ Bell believes that's why this Black Friday will be scrutinised even more closely. He also believes that despite Friday's bounce on Wall Street AI bubble fears haven't gone away but rising hopes for an interest rate cut are justified."
    ],
    "raw_sentiment": -0.3627,
    "article_count": 10,
    "last_updated": "2025-11-25"
  },
  "BAC": {
    "news_score": 0.56,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for BAC (Bank of America Corporation): Only 13% of affluent households consult their children, grandchildren, and other younger relatives when deciding what charitable causes to support. That's down from 16.5% who collaborated with younger people in 2023, the last time the biennial Study of Philanthropy was released. Citi’s Corporate Reorganization Elevates Its Wealth Management Division."
    ],
    "raw_sentiment": 0.1219,
    "article_count": 7,
    "last_updated": "2025-11-25"
  },
  "XOM": {
    "news_score": 0.64,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for XOM (Exxon Mobil Corporation): ExxonMobil (XOM) Buys 40% Stake in Bahia Pipeline as Part of New Joint Venture Exxon Mobil Corporation (NYSE:XOM), is included among the 15 Best Long Term Stocks to Buy According to Reddit. ExxonMobil relaunches natural gas project in Mozambique."
    ],
    "raw_sentiment": 0.2855,
    "article_count": 7,
    "last_updated": "2025-11-25"
  },
  "PFE": {
    "news_score": 0.49,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 3 articles from the last few days.",
      "News summary for PFE (Pfizer Inc.): Moderna is the S&P 500's most shorted stock: Here's why President Trump is expected to unveil plans to lower healthcare costs. Pfizer's entry into the weight-loss drug space, joining Novo Nordisk (NVO) and Eli Lilly (LLY), will also likely make waves."
    ],
    "raw_sentiment": -0.0227,
    "article_count": 3,
    "last_updated": "2025-11-25"
  },
  "VZ": {
    "news_score": 0.6,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 5 articles from the last few days.",
      "News summary for VZ (Verizon Communications Inc.): Bernstein Reiterates a Hold on Verizon Communications (VZ) Jim Cramer Says “I Want You to Scale Out of Verizon” Verizon Communications Inc. (NYSE:VZ): Exploring Valuation as Shares Continue Their Recent Climb. See our latest analysis for Verizon Communications."
    ],
    "raw_sentiment": 0.1947,
    "article_count": 5,
    "last_updated": "2025-11-25"
  },
  "NFLX": {
    "news_score": 0.69,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 8 articles from the last few days.",
      "News summary for NFLX (Netflix Inc.): Netflix's 10-for-1 Stock Split: Time to Buy Before It's Too Late? Netflix is the same stock it was before its stock split two weeks ago -- except now it's even cheaper. This streaming stock has outperformed the S&P 500 this year."
    ],
    "raw_sentiment": 0.3704,
    "article_count": 8,
    "last_updated": "2025-11-25"
  },
  "ADBE": {
    "news_score": 0.71,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for ADBE (Adobe Inc.): Adobe (ADBE) shares edged up in recent trading, despite the absence of a new headline event or announcement. Investors may be considering the company’s broader business trends and evaluating how its long-term valuation appears. After a steep drop earlier this year, Adobe's share price has started to claw back some ground."
    ],
    "raw_sentiment": 0.4267,
    "article_count": 6,
    "last_updated": "2025-11-25"
  },
  "CMCSA": {
    "news_score": 0.34,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 3 articles from the last few days.",
      "News summary for CMCSA (Comcast Corporation): Bernstein Reiterates a Hold Rating on Comcast Corporation (CMCSA) Since May 2025, its stock price has dropped 21.7% to $27.37 per share. Comcast has gotten torched over the last six months."
    ],
    "raw_sentiment": -0.3238,
    "article_count": 3,
    "last_updated": "2025-11-25"
  },
  "KO": {
    "news_score": 0.5,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for KO (The Coca-Cola Company): Coca-Cola is testing a bullish inverse head-and-shoulders breakout from August 2019. Celsius Holdings fuels growth as Alani Nu's record sales and its shift to PepsiCo's distribution network set up strong 2026 momentum."
    ],
    "raw_sentiment": -0.0062,
    "article_count": 7,
    "last_updated": "2025-11-25"
  },
  "T": {
    "news_score": 0.55,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 10 articles from the last few days.",
      "News summary for T (AT&T Inc.): AT&T Inc. (NYSE:T) is included among the 15 Best Long Term Stocks to Buy According to Reddit. KeyBanc upgraded AT&T to Overweight from Sector Weight. Tutor Perini Corporation (TPC) is a Trending Stock."
    ],
    "raw_sentiment": 0.0971,
    "article_count": 10,
    "last_updated": "2025-11-25"
  },
  "NKE": {
    "news_score": 0.5,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for NKE (Nike Inc.): Nike (NKE) reached $61.43 at the closing of the latest trading day, reflecting a -1.93% change compared to its last close. A number of stocks jumped in the afternoon session after comments from a key Federal Reserve official bolstered hopes for an interest rate cut."
    ],
    "raw_sentiment": 0.004,
    "article_count": 6,
    "last_updated": "2025-11-25"
  },
  "MRK": {
    "news_score": 0.67,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for MRK (Merck & Co. Inc.): Shares of Merck jumped 4.1% in the afternoon session after Wells Fargo upgraded the stock to \"Overweight\" from \"Equal-Weight,\" citing confidence in the company's future. Cidara Therapeutics Inc. (NASDAQ:CDTX) is the top stock in our list of the hottest SMID-cap stocks so far in 2025 with a 717"
    ],
    "raw_sentiment": 0.3476,
    "article_count": 6,
    "last_updated": "2025-11-25"
  },
  "ABT": {
    "news_score": 0.61,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for ABT (Abbott Laboratories): Abbott Laboratories (NYSE:ABT) is one of the stocks Jim Cramer recently offered insights on. Cramer highlighted the company’s acquisition of Exact Sciences. With its stock down 2.6% over the past three months, it is easy to disregard Abbott Laboratories."
    ],
    "raw_sentiment": 0.2159,
    "article_count": 7,
    "last_updated": "2025-11-25"
  },
  "PEP": {
    "news_score": 0.56,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for PEP (PepsiCo Inc.): PepsiCo’s share price has seen some pressure this year, with a 30-day return of -4.38% and a year-to-date decline of 2.58%. PepsiCo trades at $146.70 per share and has stayed right on track with the overall market, gaining 11.3% over the last six months."
    ],
    "raw_sentiment": 0.1267,
    "article_count": 6,
    "last_updated": "2025-11-25"
  },
  "CSCO": {
    "news_score": 0.76,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 5 articles from the last few days.",
      "News summary for CSCO (Cisco Systems Inc.): Investors are keeping a close eye on Cisco for hints about untapped potential or hidden risks. Cisco’s stock has been on a rollercoaster, slipping -2.4% this week but still up an impressive 7.7% over the past month. Recent acquisition headlines and industry partnerships have pushed Cisco into the spotlight."
    ],
    "raw_sentiment": 0.5282,
    "article_count": 5,
    "last_updated": "2025-11-25"
  },
  "ORCL": {
    "news_score": 0.56,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 4 articles from the last few days.",
      "News summary for ORCL (Oracle Corporation): Alphabet (GOOG, GOOGL) shares getting a lift from the success of its Gemini 3 rollout. Oracle (ORCL) as the company's credit default swaps climb to a 3-year high. Inspire Medical Systems (INSP) stock receiving an upgrade to Buy from Stifel analysts."
    ],
    "raw_sentiment": 0.1136,
    "article_count": 4,
    "last_updated": "2025-11-25"
  },
  "INTC": {
    "news_score": 0.82,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 4 articles from the last few days.",
      "News summary for INTC (Intel Corporation): Intel's stock narrative is evolving in response to a recent price target update. Fair value remains steady at $37.27 per share, while the discount rate has increased from 11.64% to 11.78%. This adjustment reflects both optimism around Intel's execution and clarity in its AI strategy."
    ],
    "raw_sentiment": 0.6435,
    "article_count": 4,
    "last_updated": "2025-11-25"
  },
  "CRM": {
    "news_score": 0.81,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 3 articles from the last few days.",
      "News summary for CRM (Salesforce Inc.): Barclays Reiterates a Buy on Salesforce (CRM), Keeps the PT. Salesforce, Inc. (NYSE:CRM) is one of the Best Cloud Stocks to Buy Now."
    ],
    "raw_sentiment": 0.6191,
    "article_count": 3,
    "last_updated": "2025-11-25"
  },
  "COST": {
    "news_score": 0.58,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for COST (Costco Wholesale Corporation): Costco (COST) concluded the recent trading session at $886.12, signifying a -1.43% move from its prior day's close. Costco is one of the few high-quality stocks that investors can still buy on the dip today."
    ],
    "raw_sentiment": 0.1503,
    "article_count": 6,
    "last_updated": "2025-11-25"
  },
  "ACN": {
    "news_score": 0.53,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 4 articles from the last few days.",
      "News summary for ACN (Accenture plc): Accenture (ACN) closed at $243.62 in the latest trading session, marking a -3.27% move from the prior day. Momentum around Accenture has been mixed, with shares jumping 4.6% in the past day following news of fresh industry partnerships."
    ],
    "raw_sentiment": 0.0548,
    "article_count": 4,
    "last_updated": "2025-11-25"
  },
  "CVX": {
    "news_score": 0.65,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for CVX (Chevron Corporation): Wells Fargo Raises Chevron (CVX) Price Target to $196 After Positive Investor Day Chevron Corporation (NYSE:CVX), is included among the 15 Best Long Term Stocks to Buy According to Reddit. Chevron's latest 5-Yr Plan Implies a Major Dividend Hike - CXX Stock Looks Cheap."
    ],
    "raw_sentiment": 0.3033,
    "article_count": 6,
    "last_updated": "2025-11-25"
  },
  "MCD": {
    "news_score": 0.68,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 5 articles from the last few days.",
      "News summary for MCD (McDonald's Corporation): Guggenheim Lifts McDonald’s (MCD) Price Target to $310 Amid Steady Sales Growth. McDonald's Corporation is included among the 15 Best Long Term Stocks to Buy."
    ],
    "raw_sentiment": 0.3676,
    "article_count": 5,
    "last_updated": "2025-11-25"
  },
  "DHR": {
    "news_score": 0.5,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 2 articles from the last few days.",
      "News summary for DHR (Danaher Corporation): Danaher (DHR) reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues. The projected fair value for Danaher is US$218."
    ],
    "raw_sentiment": 0.0,
    "article_count": 2,
    "last_updated": "2025-11-25"
  },
  "MDT": {
    "news_score": 0.81,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for MDT (Medtronic plc): Medtronic plc (NYSE:MDT) is a medical technology company that makes and sells devices for cardiovascular, neuroscience, and surgical applications. Medtronic’s share price has climbed 3.3% in the last week and is up a notable 23.8% year-to-date."
    ],
    "raw_sentiment": 0.6204,
    "article_count": 7,
    "last_updated": "2025-11-25"
  },
  "LLY": {
    "news_score": 0.6,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 8 articles from the last few days.",
      "News summary for LLY (Eli Lilly and Company): Moderna is the S&P 500's most shorted stock: Here's why President Trump is expected to unveil plans to lower healthcare costs. Pfizer's entry into the weight-loss drug space, joining Novo Nordisk (NVO) and Eli Lilly (LLY), will also likely make waves."
    ],
    "raw_sentiment": 0.1994,
    "article_count": 8,
    "last_updated": "2025-11-25"
  },
  "TXN": {
    "news_score": 0.34,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 3 articles from the last few days.",
      "News summary for TXN (Texas Instruments Incorporated): Texas Instruments reported a 14% year-over-year revenue increase for Q3. The company also announced a 4% dividend increase and a cautious Q4 outlook for the semiconductor market. An uptick in short interest, combined with recent insider share sales, signals that some investors are growing wary despite positive operational performance."
    ],
    "raw_sentiment": -0.3142,
    "article_count": 3,
    "last_updated": "2025-11-25"
  },
  "UNH": {
    "news_score": 0.68,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for UNH (UnitedHealth Group Incorporated): Former FDA chief Scott Gottlieb joins UnitedHealth board. Wells Fargo analyst Stephen Baxter reaffirmed a Buy rating on UnitedHealth. Pfizer, UnitedHealth, Viatris, Addus HomeCare, and Quest Stocks Trade Up."
    ],
    "raw_sentiment": 0.3616,
    "article_count": 7,
    "last_updated": "2025-11-25"
  },
  "BMY": {
    "news_score": 0.46,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 5 articles from the last few days.",
      "News summary for BMY (Bristol-Myers Squibb Company): Bayer issued a \"surprisingly positive\" report for its blood thinner over the weekend. A number of stocks jumped in the afternoon session after a Politico report revealed that the White House plans to pitch a two-year extension of Obamacare subsidies."
    ],
    "raw_sentiment": -0.0897,
    "article_count": 5,
    "last_updated": "2025-11-25"
  },
  "QCOM": {
    "news_score": 0.3,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for QCOM (QUALCOMM Incorporated): QCOM shares have seen some ups and downs recently, dropping 6.1% over the last week. News around QUALCOMM has pointed to shifting investor sentiment in the chip sector. Big chipmakers evaluating Intel’s foundry but Citi doubts deals will materialise."
    ],
    "raw_sentiment": -0.3999,
    "article_count": 6,
    "last_updated": "2025-11-25"
  },
  "HON": {
    "news_score": 0.49,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 3 articles from the last few days.",
      "News summary for HON (Honeywell International Inc.): Bank of America double-downgraded Honeywell, but the stock still has ~30% upside potential to the consensus price target. The stock has faced some rough waters lately, dropping 5.5% in the last week. Honeywell International Inc. ( NASDAQ:HON) is a well-established company."
    ],
    "raw_sentiment": -0.0112,
    "article_count": 3,
    "last_updated": "2025-11-25"
  },
  "AMGN": {
    "news_score": 0.66,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 3 articles from the last few days.",
      "News summary for AMGN (Amgen Inc.): Zacks.com users have recently been watching Amgen (AMGN) quite a bit. With many of the former leaders correcting considerably, medical stocks have offered a rare bright spot. Rising relative strength lines are making it clear that money is flowing to this area."
    ],
    "raw_sentiment": 0.3161,
    "article_count": 3,
    "last_updated": "2025-11-25"
  },
  "SBUX": {
    "news_score": 0.54,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for SBUX (Starbucks Corporation): Starbucks stock edged up 0.7% in the past week, but it is still down 7.4% year-to-date and has fallen 14.5% over the last year. Market chatter lately has highlighted Starbucks' renewed focus on international expansion, new beverage launches and evolving customer loyalty efforts."
    ],
    "raw_sentiment": 0.0782,
    "article_count": 6,
    "last_updated": "2025-11-25"
  },
  "LOW": {
    "news_score": 0.43,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for LOW (Lowe's Companies Inc.): RBC Capital trimmed its p’rice target for Lowe’s Companies, Inc. (NYSE:LOW) to $‍252 from $26​0 on November 20. Jim Cramer: “Despite This Tricky Environment, Lowe's is Doing Pretty Well” Lowe's shares are seeing a relief rally, as third-quarter results cleared a very low"
    ],
    "raw_sentiment": -0.1323,
    "article_count": 6,
    "last_updated": "2025-11-25"
  },
  "GE": {
    "news_score": 0.61,
    "news_reasons": [
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for GE (General Electric Company): GE (GE) reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues. Dr. John Adler invented a knife that's not really a knife."
    ],
    "raw_sentiment": 0.2103,
    "article_count": 7,
    "last_updated": "2025-11-25"
  }
}