{
  "AAPL": {
    "news_score": 0.72,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 4 artiklar senaste dagarna.",
      "Sammanfattning för AAPL (Apple Inc.): Apple stock continues to trade at an elevated multiple as the iPhone is gaining market share in China. Apple stock has delivered massive gains for two decades, but can it keep climbing? Explore what analysts predict for the tech giant’s future."
    ],
    "raw_sentiment": 0.443,
    "article_count": 4,
    "last_updated": "2025-11-20"
  },
  "MSFT": {
    "news_score": 0.62,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 4 artiklar senaste dagarna.",
      "Sammanfattning för MSFT (Microsoft Corporation): Microsoft Corporation (NASDAQ:MSFT) is one of the AI Stocks Analysts are Tracking Closely. On November 18, Rothschild Redburn downgraded the stock to “Neutral’ and cut the price target to $500 from $560. According to the firm, Azure has been the main growth engine for Microsoft till now."
    ],
    "raw_sentiment": 0.2442,
    "article_count": 4,
    "last_updated": "2025-11-20"
  },
  "GOOGL": {
    "news_score": 0.87,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 1 artiklar senaste dagarna.",
      "Sammanfattning för GOOGL (Alphabet Inc.): Alphabet Stock Climbed to an All-Time High Today. The internet search king is quickly becoming a dominant supplier of artificial intelligence (AI)"
    ],
    "raw_sentiment": 0.7372,
    "article_count": 1,
    "last_updated": "2025-11-20"
  },
  "AMZN": {
    "news_score": 0.57,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 6 artiklar senaste dagarna.",
      "Sammanfattning för AMZN (Amazon.com Inc.): Yahoo Finance anchor Julie Hyman examines some of the top stories on Wall Street. Goldman Sachs initiating coverage on MP Materials (MP), and Plug Power (PLUG) announcing plans to raise capital. Ramzan Karmali breaks down the four reasons why investors - and global markets - have grown so dependent on the world's largest listed company."
    ],
    "raw_sentiment": 0.1362,
    "article_count": 6,
    "last_updated": "2025-11-20"
  },
  "TSLA": {
    "news_score": 0.41,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för TSLA (Tesla Inc.): According to the Wall Street Journal, Elon Musk's xAI is looking to raise $15 billion in funding that would value it at $230 billion. Target slashed it future guidance and predicts a weak holiday season. AMD, Intel and TSMC brace for Nvidia earnings: trending stocks."
    ],
    "raw_sentiment": -0.1875,
    "article_count": 5,
    "last_updated": "2025-11-20"
  },
  "FB": {
    "news_score": 0.5,
    "news_reasons": [
      "Inga nyligen identifierade relevanta nyhetsartiklar för bolaget – nyhetsbidraget sätts till neutralt (0.50)."
    ],
    "raw_sentiment": 0.0,
    "article_count": 0,
    "last_updated": "2025-11-20"
  },
  "BRK.B": {
    "news_score": 0.5,
    "news_reasons": [
      "Inga nyligen identifierade relevanta nyhetsartiklar för bolaget – nyhetsbidraget sätts till neutralt (0.50)."
    ],
    "raw_sentiment": 0.0,
    "article_count": 0,
    "last_updated": "2025-11-20"
  },
  "NVDA": {
    "news_score": 0.46,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 9 artiklar senaste dagarna.",
      "Sammanfattning för NVDA (NVIDIA Corporation): N Nvidia's (NVDA) third quarter earnings results are due out after the closing bell on Wednesday. Goldman Sachs senior equity analyst Jim Schneider shares what he's expecting from Nvidia's earnings print. Wall Street chatter of an AI bubble forming and Nvidia CEO Jensen Huang's promise of $500 billion in AI chip demand."
    ],
    "raw_sentiment": -0.0722,
    "article_count": 9,
    "last_updated": "2025-11-20"
  },
  "JPM": {
    "news_score": 0.62,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 6 artiklar senaste dagarna.",
      "Sammanfattning för JPM (JP Morgan Chase & Co.): JPMorgan Chase (JPM) shares have shown relatively steady performance over the past month, inching up around 0.3%. For anyone tracking the banking sector, this mild movement invites a closer look at what might be driving investor sentiment right now. JPMorgan Chase’s momentum has cooled slightly after a brisk start to the year, but the recent 1-month share price return"
    ],
    "raw_sentiment": 0.2381,
    "article_count": 6,
    "last_updated": "2025-11-20"
  },
  "JNJ": {
    "news_score": 0.75,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 3 artiklar senaste dagarna.",
      "Sammanfattning för JNJ (Johnson & Johnson): Johnson & Johnson (JNJ) has received quite a bit of attention from Zacks.com users lately. It is wise to be aware of the facts that can impact the stock's prospects. In November 2025, Johnson & Johnson announced several major product developments."
    ],
    "raw_sentiment": 0.4906,
    "article_count": 3,
    "last_updated": "2025-11-20"
  },
  "V": {
    "news_score": 0.73,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 9 artiklar senaste dagarna.",
      "Sammanfattning för V (Visa Inc.): Visa (V) shares have edged lower over the past month, down 6%, reflecting a mix of market shifts and investor reactions to recent sector developments. Despite this pullback, Visa’s year-to-date return remains in positive territory. Visa reported solid revenue and adjusted profit gains in its most recent fiscal year."
    ],
    "raw_sentiment": 0.4661,
    "article_count": 9,
    "last_updated": "2025-11-20"
  },
  "WMT": {
    "news_score": 0.66,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för WMT (Walmart Inc.): Dow Jones futures rise as AI Giant Nvidia Jumps On Earnings; Jobs Report, Walmart Due. Walmart's omnichannel strength, delivery gains and newer ventures like advertising and membership underscore its solid momentum in Zacks' latest review."
    ],
    "raw_sentiment": 0.3114,
    "article_count": 5,
    "last_updated": "2025-11-20"
  },
  "PG": {
    "news_score": 0.57,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för PG (Procter & Gamble Company): The Procter & Gamble Company (NYSE:PG) is one of the biggest consumer goods companies in the world. Jim Cramer has praised the firm’s management in previous appearances. PG leans on premium, high-performance products and targeted marketing."
    ],
    "raw_sentiment": 0.1497,
    "article_count": 5,
    "last_updated": "2025-11-20"
  },
  "MA": {
    "news_score": 0.74,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 9 artiklar senaste dagarna.",
      "Sammanfattning för MA (Mastercard Incorporated): Mastercard Teams With Polygon To Bring Email-Style Aliases to Self-Custody Crypto Wallets. Polygon provides the underlying blockchain infrastructure; Mercuryo handles identity onboarding. Mastercard and Visa’s Proposed Settlement Might Change the Case for Investing in MA."
    ],
    "raw_sentiment": 0.4782,
    "article_count": 9,
    "last_updated": "2025-11-20"
  },
  "DIS": {
    "news_score": 0.46,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 10 artiklar senaste dagarna.",
      "Sammanfattning för DIS (The Walt Disney Company): Major League Baseball has completed new three-year media-rights agreements with ESPN, NBCUniversal and  Netflix. Disney’s ESPN will pay around $550 million a year for a broad deal including the rights to sell and distribute MLB.TV. YouTube TV drops more good news to subscribers after Disney deal."
    ],
    "raw_sentiment": -0.07,
    "article_count": 10,
    "last_updated": "2025-11-20"
  },
  "HD": {
    "news_score": 0.47,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 10 artiklar senaste dagarna.",
      "Sammanfattning för HD (The Home Depot Inc.): Lowe's (LOW) stock is getting a lift on Wednesday morning after topping third quarter sales estimates. Yahoo Finance senior retail reporter Brooke DiPalma dives into the home improvement retailer's earnings release."
    ],
    "raw_sentiment": -0.0624,
    "article_count": 10,
    "last_updated": "2025-11-20"
  },
  "BAC": {
    "news_score": 0.75,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 7 artiklar senaste dagarna.",
      "Sammanfattning för BAC (Bank of America Corporation): Despite a 3.9% dip over the past week, Bank of America is up 17.5% year-to-date. The bank has delivered a strong 102.4% return over five years, showing resilience and long-term growth potential."
    ],
    "raw_sentiment": 0.4954,
    "article_count": 7,
    "last_updated": "2025-11-20"
  },
  "XOM": {
    "news_score": 0.15,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för XOM (Exxon Mobil Corporation): Petrochemical giant ExxonMobil has accused Labour of damaging British business. Chairman Paul Greenhouse spoke out after the petrochemical firm announced plans to close the Mossmorran ethylene plant in Fife."
    ],
    "raw_sentiment": -0.7097,
    "article_count": 5,
    "last_updated": "2025-11-20"
  },
  "PFE": {
    "news_score": 0.75,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 3 artiklar senaste dagarna.",
      "Sammanfattning för PFE (Pfizer Inc.): Pfizer CEO on plans to bring down drug prices Pfizer CEO Albert Bourla sits down with Yahoo Finance Executive Editor Brian Sozzi to talk about when consumers can expect to see lower drug prices. Pfizer is among the companies that have made deals with the White House on pharmaceutical pricing."
    ],
    "raw_sentiment": 0.5034,
    "article_count": 3,
    "last_updated": "2025-11-20"
  },
  "VZ": {
    "news_score": 0.41,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för VZ (Verizon Communications Inc.): Fortis, Verizon, and Atmos Energy are dividend stocks worth holding no matter what your portfolio looks like. Verizon's new 100G optical ring for Monumental Sports strengthens venue connectivity and supports its digital transformation push."
    ],
    "raw_sentiment": -0.18,
    "article_count": 5,
    "last_updated": "2025-11-20"
  },
  "NFLX": {
    "news_score": 0.58,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 9 artiklar senaste dagarna.",
      "Sammanfattning för NFLX (Netflix Inc.): Major League Baseball has completed new three-year media-rights agreements with ESPN, NBCUniversal and Netflix. ESPN will pay around $550 million a year for a broad deal including the rights to sell and distribute the league’s out-of-market streaming service MLB.TV. Netflix stock falls amid scrutiny of potential Warner Bros Discovery bid."
    ],
    "raw_sentiment": 0.1629,
    "article_count": 9,
    "last_updated": "2025-11-20"
  },
  "ADBE": {
    "news_score": 0.59,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 7 artiklar senaste dagarna.",
      "Sammanfattning för ADBE (Adobe Inc.): Adobe buys Semrush for $1.9B, TJX raises outlook in Q3 beat Morning Brief host Julie Hyman tracks several of the day's top trending stock tickers. Unity Software (U) will be partnering with Epic Games to integrate games into Fortnite."
    ],
    "raw_sentiment": 0.187,
    "article_count": 7,
    "last_updated": "2025-11-20"
  },
  "CMCSA": {
    "news_score": 0.4,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för CMCSA (Comcast Corporation): The contest to acquire Warner Bros Discovery (WBD) is accelerating. At least three potential buyers: PSKY, NFLX and CMCSA. Comcast’s stock price has been on something of a rollercoaster lately. The media and telecom industries have faced headwinds from shifting consumer habits."
    ],
    "raw_sentiment": -0.2078,
    "article_count": 5,
    "last_updated": "2025-11-20"
  },
  "KO": {
    "news_score": 0.6,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 9 artiklar senaste dagarna.",
      "Sammanfattning för KO (The Coca-Cola Company): Coca-Cola is still a reliable investment in this bubbly market. Collegium Pharma and Entegris have been highlighted as Zacks Bull and Bear of the Day COLL's momentum and value appeal contrast sharply with ENTG's slide on weak guidance and falling estimates."
    ],
    "raw_sentiment": 0.209,
    "article_count": 9,
    "last_updated": "2025-11-20"
  },
  "T": {
    "news_score": 0.62,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 10 artiklar senaste dagarna.",
      "Sammanfattning för T (AT&T Inc.): The stock market jolted higher shortly after the open as much of the tech universe, including semiconductor stocks, sees aggressive buying. S&P 500 was up 1%, while the Dow rose 0.4%. Both indexes had declined for four straight days coming into today's session."
    ],
    "raw_sentiment": 0.2365,
    "article_count": 10,
    "last_updated": "2025-11-20"
  },
  "NKE": {
    "news_score": 0.63,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 7 artiklar senaste dagarna.",
      "Sammanfattning för NKE (Nike Inc.): Wells Fargo raised its outlook on Nike, Inc., highlighting increased confidence in the company's turnaround efforts and improved visibility into sales and margins. Under Armour, Inc. (NYSE:UA) is another sports apparel firm that is in the midst of a turnaround. Jim Cramer believes Under Armour is worth investing in."
    ],
    "raw_sentiment": 0.263,
    "article_count": 7,
    "last_updated": "2025-11-20"
  },
  "MRK": {
    "news_score": 0.96,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 7 artiklar senaste dagarna.",
      "Sammanfattning för MRK (Merck & Co. Inc.): Merck (MRK) shares have ticked higher this week, catching the interest of investors. The company's performance over the past month has been relatively steady. This stability invites a closer look at what might be driving sentiment."
    ],
    "raw_sentiment": 0.916,
    "article_count": 7,
    "last_updated": "2025-11-20"
  },
  "ABT": {
    "news_score": 0.82,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för ABT (Abbott Laboratories): Shares of Exact Sciences are soaring over 21% on Wednesday following a Bloomberg report that Abbott Laboratories is in advanced talks to acquire the medical-testing company. The Bloomberg report didn't include any financial terms of a potential deal. Neither Abbott nor Exacts Sciences immediately responded to a request for comment."
    ],
    "raw_sentiment": 0.6413,
    "article_count": 5,
    "last_updated": "2025-11-20"
  },
  "PEP": {
    "news_score": 0.77,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för PEP (PepsiCo Inc.): PEP, MNST, LW, UNFI and OLLI are five stocks that show improving growth drivers for 2026. Molson Coors ramps marketing and leans on core and economy brands as beer consumption softens and competitive pressure intensifies. Mid-America Apartment Communities, PepsiCo, and Mondelez International have rewarded shareholders for years and recently."
    ],
    "raw_sentiment": 0.5396,
    "article_count": 5,
    "last_updated": "2025-11-20"
  },
  "CSCO": {
    "news_score": 0.77,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 6 artiklar senaste dagarna.",
      "Sammanfattning för CSCO (Cisco Systems Inc.): Advanced Micro Devices, Cisco Systems and Saudi Arabian artificial intelligence startup Humain are forming a joint venture to build data centers in the Middle East. The yet-to-be-named joint venture will kick off with a 100-megawatt data center project in Saudi Arabia. Humain has contracted to supply generative video startup Luma AI."
    ],
    "raw_sentiment": 0.5434,
    "article_count": 6,
    "last_updated": "2025-11-20"
  },
  "ORCL": {
    "news_score": 0.31,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för ORCL (Oracle Corporation): Oracle (ORCL) shares moved slightly in recent trading, capturing attention from investors as sentiment shifts around major tech names. The company’s performance this month shows mixed results, which encourages a closer evaluation of its longer-term track record and fundamentals. See our latest analysis for Oracle."
    ],
    "raw_sentiment": -0.371,
    "article_count": 5,
    "last_updated": "2025-11-20"
  },
  "INTC": {
    "news_score": 0.26,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 4 artiklar senaste dagarna.",
      "Sammanfattning för INTC (Intel Corporation): AMD, Intel and TSMC brace for Nvidia earnings: trending stocks. Xiaomi sees shares plummet - even as its EV arm turns an operating profit for the first time. Wh Smith pushes for a turnaround. Doordash delivers some news - including a new partnership."
    ],
    "raw_sentiment": -0.4788,
    "article_count": 4,
    "last_updated": "2025-11-20"
  },
  "CRM": {
    "news_score": 0.95,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 2 artiklar senaste dagarna.",
      "Sammanfattning för CRM (Salesforce Inc.): Despite a slight dip of 1.9% over the last week and 2.5% across the past month, the stock is still up an impressive 65.4% over three years. Cantor Fitzgerald maintained its “Overweight” rating on the stock with a price target of $325.00."
    ],
    "raw_sentiment": 0.9012,
    "article_count": 2,
    "last_updated": "2025-11-20"
  },
  "COST": {
    "news_score": 0.52,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 8 artiklar senaste dagarna.",
      "Sammanfattning för COST (Costco Wholesale Corporation): Costco Wholesale (COST) just posted an 8.6% rise in October sales along with a strong start to its new fiscal year, driven by a shift toward apparel and home goods in its product mix. The retail stock is down 15% from its 52-week high."
    ],
    "raw_sentiment": 0.0357,
    "article_count": 8,
    "last_updated": "2025-11-20"
  },
  "ACN": {
    "news_score": 0.64,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för ACN (Accenture plc): Accenture invests in Alembic, partners on Causal AI for marketing insights. Investors are sitting on a loss of 31% if they invested a year ago. Investors can approximate the average market return by buying an index fund."
    ],
    "raw_sentiment": 0.2853,
    "article_count": 5,
    "last_updated": "2025-11-20"
  },
  "CVX": {
    "news_score": 0.78,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 4 artiklar senaste dagarna.",
      "Sammanfattning för CVX (Chevron Corporation): TotalEnergies and Chevron Vie for Stake in Namibia’s 10-Billion-Barrel Discovery. CVX and XOM are racing to capture strategic oilfields and refineries across key regions. CNQ's record production, low-decline assets, and cleaner valuation stand out."
    ],
    "raw_sentiment": 0.5646,
    "article_count": 4,
    "last_updated": "2025-11-20"
  },
  "MCD": {
    "news_score": 0.22,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 3 artiklar senaste dagarna.",
      "Sammanfattning för MCD (McDonald's Corporation): McDonald's stock has eased back slightly, down 0.7% over the last week and 1.1% in the past month. The stock has delivered a solid 55.4% return over five years. Recent news about McDonald's ongoing global expansions and new menu innovations has continued."
    ],
    "raw_sentiment": -0.5589,
    "article_count": 3,
    "last_updated": "2025-11-20"
  },
  "DHR": {
    "news_score": 0.14,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 1 artiklar senaste dagarna.",
      "Sammanfattning för DHR (Danaher Corporation): Shareholders 2.8% loss in Danaher (NYSE:DHR) partly attributable to the company's decline in earnings over past three years. Many investors define successful investing as beating the market average over the long term."
    ],
    "raw_sentiment": -0.7166,
    "article_count": 1,
    "last_updated": "2025-11-20"
  },
  "MDT": {
    "news_score": 0.42,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 6 artiklar senaste dagarna.",
      "Sammanfattning för MDT (Medtronic plc): Futures are trading higher this morning, as all the major indices once again closed lower on Tuesday. The Dow Jones Industrials closed down 1.07% at 46,091, while the S&P 500 was last seen at 6617, down 0.83%. The NASDAQ, which has been hit the hardest."
    ],
    "raw_sentiment": -0.1672,
    "article_count": 6,
    "last_updated": "2025-11-20"
  },
  "LLY": {
    "news_score": 0.96,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 7 artiklar senaste dagarna.",
      "Sammanfattning för LLY (Eli Lilly and Company): Eli Lilly and J&J recently announced partnerships with AI chipmaker Nvidia, pointing to a broader trend of tie-ups to advance drug discovery and improve workflows. LLY has strong technical momentum and is trading at new all-time highs. Shares are up 43% over the past year."
    ],
    "raw_sentiment": 0.9163,
    "article_count": 7,
    "last_updated": "2025-11-20"
  },
  "TXN": {
    "news_score": 0.5,
    "news_reasons": [
      "Inga nyligen identifierade relevanta nyhetsartiklar för bolaget – nyhetsbidraget sätts till neutralt (0.50)."
    ],
    "raw_sentiment": 0.0,
    "article_count": 0,
    "last_updated": "2025-11-20"
  },
  "UNH": {
    "news_score": 0.4,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för UNH (UnitedHealth Group Incorporated): UnitedHealth Group (UNH) shares have seen a bit of volatility over the month, moving down 12%. While not linked to a single recent event, some investors are weighing longer-term earnings trends and sector sentiment. The stock’s recent performance has been rocky, with a 10.1% decline over the past month and a 36.5% drop year-to-"
    ],
    "raw_sentiment": -0.206,
    "article_count": 5,
    "last_updated": "2025-11-20"
  },
  "BMY": {
    "news_score": 0.38,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 4 artiklar senaste dagarna.",
      "Sammanfattning för BMY (Bristol-Myers Squibb Company): Bristol Myers (BMY) is included among the 15 Best Passive Income Stocks to Buy Right Now. BMY shares drop after halting the Librexia ACS trial, though other milvexian studies continue with top-line data expected in 2026."
    ],
    "raw_sentiment": -0.2412,
    "article_count": 4,
    "last_updated": "2025-11-20"
  },
  "QCOM": {
    "news_score": 0.42,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 7 artiklar senaste dagarna.",
      "Sammanfattning för QCOM (QUALCOMM Incorporated): The move comes amid the broader trend of Big Tech companies strengthening their ties to the Middle East. Qualcomm vs. Intel: Which Chip Stock is the Better Buy Now? INTC edges out QCOM as valuation, price momentum and growth prospects give it a slight lead."
    ],
    "raw_sentiment": -0.1578,
    "article_count": 7,
    "last_updated": "2025-11-20"
  },
  "HON": {
    "news_score": 0.21,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 5 artiklar senaste dagarna.",
      "Sammanfattning för HON (Honeywell International Inc.): BofA Securities analyst Andrew Obin cut his rating on Honeywell shares all the way to Sell from Buy. BofA warns that the company faces a difficult stretch of catalysts ahead of its Aerospace spin-off and continues to trail peers on growth."
    ],
    "raw_sentiment": -0.5764,
    "article_count": 5,
    "last_updated": "2025-11-20"
  },
  "AMGN": {
    "news_score": 0.81,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 3 artiklar senaste dagarna.",
      "Sammanfattning för AMGN (Amgen Inc.): Jim Cramer has started to discuss pharmaceutical giant Amgen Inc. (NASDAQ:AMGN) more frequently. Most of his discussions surround the firm’s Repatha drug that aims to reduce cholesterol and prevent heart disease. Investors are starting to re-evaluate the pharmaceutical giant's current valuation in light of these recent gains."
    ],
    "raw_sentiment": 0.6261,
    "article_count": 3,
    "last_updated": "2025-11-20"
  },
  "SBUX": {
    "news_score": 0.53,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 8 artiklar senaste dagarna.",
      "Sammanfattning för SBUX (Starbucks Corporation): Starbucks Corporation (NASDAQ:SBUX) is one of the stocks on Jim Cramer’s radar. Cramer has continued to stress that viewers have faith in the firm. Starbucks' fourth-quarter margin plunge amid persistent inflation and rising labor costs clouds its turnaround."
    ],
    "raw_sentiment": 0.0559,
    "article_count": 8,
    "last_updated": "2025-11-20"
  },
  "LOW": {
    "news_score": 0.33,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 6 artiklar senaste dagarna.",
      "Sammanfattning för LOW (Lowe's Companies Inc.): Lowe's stock lifted on Q3 sales beat, raises sales guidance. Chipmaker Nvidia (NVDA) is set to report third quarter earnings figures after the closing bell. Retailers Target (TGT), Lowe's (LOW), and TJX Companies (TJX) are also out with their respective earnings this morning."
    ],
    "raw_sentiment": -0.3492,
    "article_count": 6,
    "last_updated": "2025-11-20"
  },
  "GE": {
    "news_score": 0.69,
    "news_reasons": [
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 7 artiklar senaste dagarna.",
      "Sammanfattning för GE (General Electric Company): Trump says $270 billion in deals being signed at US-Saudi Forum. World's largest aerospace companies gather at Dubai Airshow. GE Aerospace reported strong third-quarter earnings as its flywheel looks set to benefit."
    ],
    "raw_sentiment": 0.3875,
    "article_count": 7,
    "last_updated": "2025-11-20"
  }
}