{
  "low": {
    "symbol": "JNJ",
    "company_name": "Johnson & Johnson",
    "week_start": "2025-11-25",
    "week_end": "2025-12-02",
    "reasons": [
      "Price performance over the last 5 trading days: about 3.2%.",
      "Measured daily volatility around 0.9%, classified as low risk.",
      "Risk-adjusted model score (momentum minus volatility) gives a relatively attractive profile.",
      "News analysis (AI model, summary across multiple sources):",
      "News sentiment (AI model, FinBERT) based on 3 articles from the last few days.",
      "News summary for JNJ (Johnson & Johnson): Johnson & Johnson (NYSE:JNJ) is a global healthcare company that develops, manufactures, and sells pharmaceutical products and medical devices. Wall Street analysts expect the company to post EPS of $0.82 in Q4 2025."
    ],
    "score": 0.033054442050427,
    "risk": "low"
  },
  "medium": {
    "symbol": "MDT",
    "company_name": "Medtronic plc",
    "week_start": "2025-11-25",
    "week_end": "2025-12-02",
    "reasons": [
      "Price performance over the last 5 trading days: about 7.2%.",
      "Measured daily volatility around 1.5%, classified as medium risk.",
      "Risk-adjusted model score (momentum minus volatility) gives a relatively attractive profile.",
      "News analysis (AI model, summary across multiple sources):",
      "News sentiment (AI model, FinBERT) based on 7 articles from the last few days.",
      "News summary for MDT (Medtronic plc): Medtronic plc (NYSE:MDT) is a medical technology company that makes and sells devices for cardiovascular, neuroscience, and surgical applications. Medtronic’s share price has climbed 3.3% in the last week and is up a notable 23.8% year-to-date."
    ],
    "score": 0.07422585007866571,
    "risk": "medium"
  },
  "high": {
    "symbol": "GOOGL",
    "company_name": "Alphabet Inc.",
    "week_start": "2025-11-25",
    "week_end": "2025-12-02",
    "reasons": [
      "Price performance over the last 5 trading days: about 11.8%.",
      "Measured daily volatility around 2.4%, classified as high risk.",
      "Risk-adjusted model score (momentum minus volatility) gives a relatively attractive profile.",
      "News analysis (AI model, summary across multiple sources):",
      "News sentiment (AI model, FinBERT) based on 6 articles from the last few days.",
      "News summary for GOOGL (Alphabet Inc.): Alphabet (GOOG, GOOGL) is seeing its shares soar thanks to early praise for Google's Gemini 3. Anthropic (ANTH.PVT) may not let Google have the spotlight for long, debuting its Claude Opus 4.5 model on Monday. Stay up to date on the latest market action, minute-by-minute, with&n"
    ],
    "score": 0.08505263750678332,
    "risk": "high"
  }
}