{
  "low": {
    "symbol": "ABT",
    "company_name": "Abbott Laboratories",
    "week_start": "2025-11-19",
    "week_end": "2025-11-26",
    "reasons": [
      "Senaste 5 handelsdagarna: cirka 2.4% prisutveckling.",
      "Uppmätt dagsvolatilitet kring 0.9%, klassad som low risk.",
      "Riskjusterad modellscore (momentum minus volatilitet) ger en relativt attraktiv profil.",
      "Nyhetsanalys (AI-modell, sammanfattning av flera källor):",
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 2 artiklar senaste dagarna.",
      "Sammanfattning för ABT (Abbott Laboratories): Abbott Laboratories (NYSE:ABT) jumps 3.3% this week, though earnings growth is still tracking behind three-year shareholder returns. Abbott reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues."
    ],
    "score": 0.017892249273677184,
    "risk": "low"
  },
  "medium": {
    "symbol": "CSCO",
    "company_name": "Cisco Systems Inc.",
    "week_start": "2025-11-19",
    "week_end": "2025-11-26",
    "reasons": [
      "Senaste 5 handelsdagarna: cirka 7.9% prisutveckling.",
      "Uppmätt dagsvolatilitet kring 1.7%, klassad som medium risk.",
      "Riskjusterad modellscore (momentum minus volatilitet) ger en relativt attraktiv profil.",
      "Nyhetsanalys (AI-modell, sammanfattning av flera källor):",
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 6 artiklar senaste dagarna.",
      "Sammanfattning för CSCO (Cisco Systems Inc.): Cisco Systems Inc. (NASDAQ:CSCO) also reported earnings the day this show was aired. Cramer had asserted that the stock was cheap and its valuation. Shares of Cisco are trading just under $78 per share. Despite this, retail investors on Reddit have turned starkly bearish."
    ],
    "score": 0.07277525807499263,
    "risk": "medium"
  },
  "high": {
    "symbol": "AMGN",
    "company_name": "Amgen Inc.",
    "week_start": "2025-11-19",
    "week_end": "2025-11-26",
    "reasons": [
      "Senaste 5 handelsdagarna: cirka 1.6% prisutveckling.",
      "Uppmätt dagsvolatilitet kring 2.1%, klassad som high risk.",
      "Riskjusterad modellscore (momentum minus volatilitet) ger en relativt attraktiv profil.",
      "Nyhetsanalys (AI-modell, sammanfattning av flera källor):",
      "Nyhetsanalys (AI-modell, FinBERT) baserad på 4 artiklar senaste dagarna.",
      "Sammanfattning för AMGN (Amgen Inc.): Jim Cramer has started to discuss pharmaceutical giant Amgen Inc. (NASDAQ:AMGN) more frequently. Most of his discussions surround the firm’s Repatha drug that aims to reduce cholesterol and prevent heart attacks. Investors are starting to re-evaluate the pharmaceutical giant's current valuation in light of recent gains."
    ],
    "score": -0.005747945281801761,
    "risk": "high"
  }
}